# BalusterUpsideDown Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..BalusterUpsideDown Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Top reference is below Bottom reference for one or more Balusters. These Balusters are not created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BalusterUpsideDown { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BalusterUpsideDown As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BalusterUpsideDown {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace